Repository: samikeijonen/skukkakauppa
Catalog: languages/skukkakauppa-plugin-*.po
Languages: fi

source: Flower Price
fi: Kukan hinta

source: Add Flower Price.
fi: Lisää kukan hinta.

source: Flowers
fi: Kukat

source: Flower
fi: Kukat

source: Add New
fi: Lisää uusi

source: Add New Flower
fi: Lisää uusi kukka

source: Edit Flower
fi: Editoi kukkaa

source: New Flower
fi: Uusi kukka

source: View Flower
fi: Näytä kukka

source: Search Flowers
fi: Etsi kukkia

source: No flowers found
fi: Kukkia ei löytynyt

source: No flowers found in Trash
fi: Kukkia ei löytynyt roskakorista

source: Parent Flower:
fi: Ylemmän tason kukka:

source: Flowers for you
fi: Kukkia elämän eri tilanteisiin

# taxonomy general name
source: Flower Type Categories
fi: Kukkatyyypit

# taxonomy singular name
source: Flower Type category
fi: Kukkatyyppi

source: Search Flower Type Categories
fi: Etsi kukkatyyppejä

source: All Flower Type Categories
fi: Kaikki kukkatyypit

source: Parent Flower Type Category
fi: Ylemmän tason kukkatyyppi

source: Parent Flower Type Category:
fi: Ylemmän tason kukkatyyppi:

source: Edit Flower Type Categories
fi: Editoi kukkatyyppejä

source: Update Flower Type Category
fi: Päivitä kukkatyyppi

source: Add New Flower Type Category
fi: Lisää uusi kukkatyyppi

source: New Flower Type Category Name
fi: Uuden kukkatyypin nimi

source: Flower Type Categories
fi: Kukkatyypit
